tutorials/multiphase/compressibleInterFoam/laminar/plateFilm/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name    plateFaceSet;
        type    faceSet;
        action  new;
        source  patchToFace;
        patch   plate;
    }

    {
        name    plateFaces;
        type    faceZoneSet;
        action  new;
        source  setToFaceZone;
        faceSet plateFaceSet;
    }
);


// ************************************************************************* //
